rapport.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>IFT3325 Téléinformatique : Devoir 2</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">IFT3325 Téléinformatique : Devoir 2</h1>
<div id="outline-container-orga41c5dd" class="outline-2">
<h2 id="orga41c5dd"><span class="section-number-2">1.</span> Diagramme de classes</h2>
</div>

<div id="outline-container-orgfd60b93" class="outline-2">
<h2 id="orgfd60b93"><span class="section-number-2">2.</span> Classes</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4488b65" class="outline-3">
<h3 id="org4488b65"><span class="section-number-3">2.1.</span> BitStuffer</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orge6af682" class="outline-4">
<h4 id="orge6af682"><span class="section-number-4">2.1.1.</span> <span class="underline">+stuff(bitstring:String):String</span></h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Prends en paramètre une chaine de '0' et '1' sous forme
de String et retourne la même chaine où chaque suite de
cinq '1' est maintenant suivie d'un '0'.
</p>
</div>
</div>
<div id="outline-container-org91d52fe" class="outline-4">
<h4 id="org91d52fe"><span class="section-number-4">2.1.2.</span> <span class="underline">+destuff(bitstring:String):String</span></h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Effectue l'inverse de la fonction <code>stuff(String)</code> en retirant
tous les '1' qui suivent cinq '0'
de sorte que <code>s==destuff(stuff(s))</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-org89628c0" class="outline-3">
<h3 id="org89628c0"><span class="section-number-3">2.2.</span> CharFrame</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgad47f8f" class="outline-4">
<h4 id="orgad47f8f"><span class="section-number-4">2.2.1.</span> +CharFrame(type:char, data:String, polynomial:String)</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Construit une trame à partir d'un type, de données et d'un polynôme
utilisé pour le contrôle d'erreur. Le numéro de la trame
doit être ajouté via la méthode <code>setNum(int)</code>.
</p>
</div>
</div>
<div id="outline-container-orgb28959a" class="outline-4">
<h4 id="orgb28959a"><span class="section-number-4">2.2.2.</span> +CharFrame(frame:String, polynomial:String)</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Construit une trame à partir d'une string de bits telle que
celle produite par la fonction <code>format()</code>. Si la trame comprends des erreurs
lance une <code>InvalidFrameException</code>.
</p>
</div>
</div>
<div id="outline-container-org282a131" class="outline-4">
<h4 id="org282a131"><span class="section-number-4">2.2.3.</span> <span class="underline">-padLeft(str:String, pad:char, targetlength:int):String</span></h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
Ajoute le <code>pad</code> au début de <code>str</code> autant de fois qu'il faut pour qu'elle
soit de taille au moins <code>targetlength</code>.
</p>
</div>
</div>
<div id="outline-container-org3a9c1a3" class="outline-4">
<h4 id="org3a9c1a3"><span class="section-number-4">2.2.4.</span> -computeCRC()</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
Calcule le checksum pour la trame et le place dans le champ <code>crc</code>.
</p>
</div>
</div>
<div id="outline-container-orgbd14897" class="outline-4">
<h4 id="orgbd14897"><span class="section-number-4">2.2.5.</span> +getType():char</h4>
<div class="outline-text-4" id="text-2-2-5">
<p>
Retourne le type de la trame.
</p>
</div>
</div>
<div id="outline-container-org4d285e5" class="outline-4">
<h4 id="org4d285e5"><span class="section-number-4">2.2.6.</span> +setType(type:char)</h4>
<div class="outline-text-4" id="text-2-2-6">
<p>
Assigne un type à la trame.
</p>
</div>
</div>
<div id="outline-container-org70712ca" class="outline-4">
<h4 id="org70712ca"><span class="section-number-4">2.2.7.</span> +getNum():int</h4>
<div class="outline-text-4" id="text-2-2-7">
<p>
Retourne le numéro de la trame.
</p>
</div>
</div>
<div id="outline-container-org7ed5373" class="outline-4">
<h4 id="org7ed5373"><span class="section-number-4">2.2.8.</span> +setNum(num:int)</h4>
<div class="outline-text-4" id="text-2-2-8">
<p>
Assigne un numéro qui doit être représentable sur
<code>NUM_BITSIZE</code> bits à la trame.
</p>
</div>
</div>
<div id="outline-container-org4cb66ea" class="outline-4">
<h4 id="org4cb66ea"><span class="section-number-4">2.2.9.</span> +getData():String</h4>
<div class="outline-text-4" id="text-2-2-9">
<p>
Retourne les données de la trame.
</p>
</div>
</div>
<div id="outline-container-orgd543867" class="outline-4">
<h4 id="orgd543867"><span class="section-number-4">2.2.10.</span> +setData(String data)</h4>
<div class="outline-text-4" id="text-2-2-10">
<p>
Assigne de nouvelles données à la trame.
</p>
</div>
</div>
<div id="outline-container-org40dada7" class="outline-4">
<h4 id="org40dada7"><span class="section-number-4">2.2.11.</span> +format():String</h4>
<div class="outline-text-4" id="text-2-2-11">
<p>
Retourne la trame sous forme de chaine de bits.
</p>
</div>
</div>
<div id="outline-container-orge3c8a84" class="outline-4">
<h4 id="orge3c8a84"><span class="section-number-4">2.2.12.</span> +isValid():boolean</h4>
<div class="outline-text-4" id="text-2-2-12">
<p>
retourne vrai si le champs crc est correct.
</p>
</div>
</div>
</div>
<div id="outline-container-org7a2208d" class="outline-3">
<h3 id="org7a2208d"><span class="section-number-3">2.3.</span> CheckSumCalculator</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org3f83518" class="outline-4">
<h4 id="org3f83518"><span class="section-number-4">2.3.1.</span> <span class="underline">-xor(s1:String, s2:String):String</span></h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Retourne le XOR de deux chaines de bits.
La chaine la plus courte est allongée
de suffisamment de '0' pour que les deux
chaines soient de tailles égales.
</p>
</div>
</div>
<div id="outline-container-org82d46b9" class="outline-4">
<h4 id="org82d46b9"><span class="section-number-4">2.3.2.</span> <span class="underline">+cyclicDivisionRest(bitstring:String, polynomial:String):String</span></h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
Retourne le reste de la division mod 2 du polynome <code>bitstring</code>
par le polynome <code>polynomial</code>
</p>
</div>
</div>
<div id="outline-container-org4b10f04" class="outline-4">
<h4 id="org4b10f04"><span class="section-number-4">2.3.3.</span> <span class="underline">-padLeft(str:String, pad:char, targetlength:int):String</span></h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
Ajoute le <code>pad</code> au début de <code>str</code> autant de fois qu'il faut pour qu'elle
soit de taille au moins <code>targetlength</code>.
</p>
</div>
</div>
<div id="outline-container-org4e46a22" class="outline-4">
<h4 id="org4e46a22"><span class="section-number-4">2.3.4.</span> <span class="underline">+computeCRC(bitstring:String, polynomial:String):String</span></h4>
<div class="outline-text-4" id="text-2-3-4">
<p>
Calcule et retourne le Cyclical Redundancy Code.
</p>
</div>
</div>
</div>
<div id="outline-container-org41433e2" class="outline-3">
<h3 id="org41433e2"><span class="section-number-3">2.4.</span> CLI</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-orga00da1c" class="outline-4">
<h4 id="orga00da1c"><span class="section-number-4">2.4.1.</span> _+main(args:String[])</h4>
</div>
</div>
</div>
</div>
</body>
</html>
